htdocs/app/controllers/ActivitylistController.php

    protected function findModel($id)
    {
        if (($model = Activitylist::findOne($id)) !== null) {
---
SELECT * FROM `activitylist` WHERE `ID`='2'