htdocs/app/controllers/ActivityorderController.php

    public function  actionMyOrders(){
        $this->layout = "main_website";
        $session = Yii::$app->session;
        $user = new Activityuser();

//        $openid ='oiqKit-Uv7d3bEyN1Qb3N0nsWBpU';
//        $session->set('openid', $openid);
//        $openid = $session['openid'];
//        $UserInfo = $user->findUserByOpenIDOne($openid);

        if (!isset($session['openid']) && empty($session['openid'])){
            $appID = Yii::$app->params['WxAppID'];
            $secret = Yii::$app->params['WxSecret'];
            $UserInfo =  $this->getUserInfo($appID,$secret);
            $openid = $UserInfo['openid'];
            $session->set('openid', $openid);
        }else{
            $openid = $session['openid'];
            $UserInfo = $user->findUserByOpenIDOne($openid);
---
SELECT * FROM `activityuser` WHERE `UserID`=4